In [2]:
import pandas as pd

In [4]:
df = pd.read_csv('E:\\DATA_ANALYSIS\\data\\home-credit-default-risk\\application_train.csv')

In [5]:
df.head()

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,...,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
0,100002,1,Cash loans,M,N,Y,0,202500.0,406597.5,24700.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,1.0
1,100003,0,Cash loans,F,N,N,0,270000.0,1293502.5,35698.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
2,100004,0,Revolving loans,M,Y,Y,0,67500.0,135000.0,6750.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
3,100006,0,Cash loans,F,N,Y,0,135000.0,312682.5,29686.5,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,100007,0,Cash loans,M,N,Y,0,121500.0,513000.0,21865.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0

Removing the columns which has more than 50% missing values.

In [16]:
na_col = df.isna().sum().sort_values(ascending=False) / len(df)
cols_to_drop = na_col[na_col> 0.5].index
df.drop(columns=cols_to_drop, inplace=True)
df.shape

(307511, 81)

Selected 15 major columns depending upon demographics , financials , employment related features.

In [27]:
key_columns = [
    'SK_ID_CURR', 'TARGET', 'AMT_INCOME_TOTAL', 'AMT_CREDIT', 'AMT_ANNUITY', 'AMT_GOODS_PRICE',
    'DAYS_BIRTH', 'CODE_GENDER',
    'NAME_EDUCATION_TYPE', 'NAME_FAMILY_STATUS', 'DAYS_EMPLOYED', 'NAME_HOUSING_TYPE',
    'OCCUPATION_TYPE', 'NAME_CONTRACT_TYPE', 'DAYS_REGISTRATION'
]
df = df[key_columns]
df.head()

,SK_ID_CURR,TARGET,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,AMT_GOODS_PRICE,DAYS_BIRTH,CODE_GENDER,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,DAYS_EMPLOYED,NAME_HOUSING_TYPE,OCCUPATION_TYPE,NAME_CONTRACT_TYPE,DAYS_REGISTRATION
0,100002,1,202500.0,406597.5,24700.5,351000.0,-9461,M,Secondary / secondary special,Single / not married,-637,House / apartment,Laborers,Cash loans,-3648.0
1,100003,0,270000.0,1293502.5,35698.5,1129500.0,-16765,F,Higher education,Married,-1188,House / apartment,Core staff,Cash loans,-1186.0
2,100004,0,67500.0,135000.0,6750.0,135000.0,-19046,M,Secondary / secondary special,Single / not married,-225,House / apartment,Laborers,Revolving loans,-4260.0
3,100006,0,135000.0,312682.5,29686.5,297000.0,-19005,F,Secondary / secondary special,Civil marriage,-3039,House / apartment,Laborers,Cash loans,-9833.0
4,100007,0,121500.0,513000.0,21865.5,513000.0,-19932,M,Secondary / secondary special,Single / not married,-3038,House / apartment,Core staff,Cash loans,-4311.0

In [ ]:
df['OCCUPATION_TYPE'].fillna('Unknown' , inplace=True)
df.isna().sum() / len(df)

SK_ID_CURR             0.000000
TARGET                 0.000000
AMT_INCOME_TOTAL       0.000000
AMT_CREDIT             0.000000
AMT_ANNUITY            0.000039
AMT_GOODS_PRICE        0.000904
DAYS_BIRTH             0.000000
CODE_GENDER            0.000000
NAME_EDUCATION_TYPE    0.000000
NAME_FAMILY_STATUS     0.000000
DAYS_EMPLOYED          0.000000
NAME_HOUSING_TYPE      0.000000
OCCUPATION_TYPE        0.000000
NAME_CONTRACT_TYPE     0.000000
DAYS_REGISTRATION      0.000000
dtype: float64

In [33]:
df['AGE_YEAR'] = df['DAYS_BIRTH'] / -365
df['AGE_YEAR'].round()

0         26.0
1         46.0
2         52.0
3         52.0
4         55.0
          ...
307506    26.0
307507    57.0
307508    41.0
307509    33.0
307510    46.0
Name: AGE_YEAR, Length: 307511, dtype: float64

In [42]:
df['DAYS_EMPLOYED'] = df['DAYS_EMPLOYED'].apply(lambda x:0 if x>0 else x)
df['DAYS_EMPLOYED']=df['DAYS_EMPLOYED'].abs()
df['Years_EMPLOYED'] = df['DAYS_EMPLOYED'] / 365
df['Years_EMPLOYED'].round()

0          2.0
1          3.0
2          1.0
3          8.0
4          8.0
          ...
307506     1.0
307507     0.0
307508    22.0
307509    13.0
307510     3.0
Name: Years_EMPLOYED, Length: 307511, dtype: float64